import React from 'react';
import './VacancyCreated.scss';
import { useState } from 'react';
import { Link } from 'react-router-dom';
import Header from '../../../Components/Header/Header';
import Nav from '../../../Components/Nav/Nav';
import InputArea from '../../../Components/Input/InputArea/InputArea';
import SolidButton from '../../../Components/Buttons/SolidButton/SolidButton';
/**
 * VacancyCreated component renders a page indicating that a vacancy has been successfully created.
 * It includes a header, navigation, and a card with a congratulatory message.
 * Additionally, it provides an input area for describing the ideal candidate and a button to proceed.
 *
 * @component
 * @example
 * return (
 *   <VacancyCreated />
 * )
 *
 * @returns {JSX.Element} The rendered component.
 */
const VacancyCreated = () => {
    const [value, setValue] = useState('Опишіть кандидата якого ви шукаєте');
    return (
        <>
            <Header></Header>
            <Nav></Nav>
            <div className="vacancy-created-wrapper">
                <div className="inner-vacancy-created-wrapper">
                    <div className="created-card">
                        <svg width="130" height="130" viewBox="0 0 130 130" fill="none" xmlns="http://www.w3.org/2000/svg">
                            <circle cx="65" cy="65" r="65" fill="#3F7EE8" />
                            <path fillRule="evenodd" clipRule="evenodd" d="M64.9993 36.3332C57.3965 36.3332 50.105 39.3534 44.729 44.7294C39.3529 50.1055 36.3327 57.397 36.3327 64.9998C36.3327 72.6027 39.3529 79.8942 44.729 85.2702C50.105 90.6463 57.3965 93.6665 64.9993 93.6665C72.6022 93.6665 79.8937 90.6463 85.2697 85.2702C90.6458 79.8942 93.666 72.6027 93.666 64.9998C93.666 57.397 90.6458 50.1055 85.2697 44.7294C79.8937 39.3534 72.6022 36.3332 64.9993 36.3332ZM29.166 64.9998C29.166 45.2091 45.2086 29.1665 64.9993 29.1665C84.7901 29.1665 100.833 45.2091 100.833 64.9998C100.833 84.7906 84.7901 100.833 64.9993 100.833C45.2086 100.833 29.166 84.7906 29.166 64.9998ZM52.4577 57.8332C51.7589 57.8332 50.8667 58.2775 50.2862 59.4385C49.856 60.2805 49.1105 60.9184 48.212 61.2132C47.3136 61.5079 46.3351 61.4356 45.4897 61.012C44.6444 60.5883 44.0007 59.8478 43.6991 58.9516C43.3974 58.0555 43.4621 57.0764 43.8792 56.2278C45.4415 53.1032 48.5626 50.6665 52.4577 50.6665C56.3528 50.6665 59.4703 53.1032 61.0362 56.2278C61.4532 57.0764 61.518 58.0555 61.2163 58.9516C60.9146 59.8478 60.271 60.5883 59.4256 61.012C58.5803 61.4356 57.6018 61.5079 56.7033 61.2132C55.8049 60.9184 55.0593 60.2805 54.6292 59.4385C54.0487 58.2775 53.16 57.8332 52.4577 57.8332ZM77.541 57.8332C76.8423 57.8332 75.95 58.2775 75.3695 59.4385C75.1609 59.8629 74.8704 60.2419 74.5147 60.5535C74.1589 60.8651 73.745 61.1032 73.2968 61.254C72.8487 61.4049 72.375 61.4656 71.9033 61.4326C71.4315 61.3995 70.971 61.2734 70.5482 61.0616C70.1254 60.8497 69.7487 60.5563 69.4399 60.1981C69.1311 59.84 68.8962 59.4243 68.7488 58.9749C68.6014 58.5256 68.5444 58.0515 68.581 57.58C68.6177 57.1085 68.7474 56.649 68.9625 56.2278C70.5284 53.1032 73.6459 50.6665 77.541 50.6665C81.4361 50.6665 84.5536 53.1032 86.1195 56.2278C86.5366 57.0764 86.6013 58.0555 86.2996 58.9516C85.998 59.8478 85.3543 60.5883 84.509 61.012C83.6636 61.4356 82.6851 61.5079 81.7866 61.2132C80.8882 60.9184 80.1427 60.2805 79.7125 59.4385C79.132 58.2775 78.2433 57.8332 77.541 57.8332ZM52.8303 73.3777C53.1418 73.0246 53.5197 72.7363 53.9426 72.5294C54.3655 72.3224 54.825 72.2008 55.2948 72.1716C55.7647 72.1423 56.2358 72.2059 56.6811 72.3587C57.1264 72.5116 57.5372 72.7507 57.89 73.0623C59.7892 74.7393 62.2724 75.7498 64.9993 75.7498C67.7263 75.7498 70.2131 74.7393 72.1087 73.0623C72.8215 72.4332 73.755 72.113 74.7038 72.1721C75.6527 72.2312 76.5392 72.6649 77.1683 73.3777C77.7975 74.0904 78.1177 75.0239 78.0586 75.9728C77.9994 76.9217 77.5658 77.8082 76.853 78.4373C73.5828 81.3302 69.3655 82.9238 64.9993 82.9165C60.6332 82.9238 56.4159 81.3302 53.1457 78.4373C52.7926 78.1259 52.5043 77.748 52.2974 77.3251C52.0904 76.9022 51.9689 76.4427 51.9396 75.9728C51.9103 75.503 51.9739 75.0319 52.1267 74.5866C52.2796 74.1413 52.5187 73.7305 52.8303 73.3777Z" fill="white" />
                        </svg>
                        <h3 className="title">Вакансія створена!</h3>
                        <p className="description">Щиро вітаю! Ваша нова вакансія успішно створена. Тепер давайте познайомимо вас із профілем ідеального кандидата, щоб забезпечити найкращий відповідність вашій вакансії.</p>
                    </div>
                    <div className="best-fit-wrapper">
                        <h1>Ідеальна особа кандидата</h1>
                        <InputArea value={value} setValue={setValue}></InputArea>
                        <Link to='/BuxOnline/company/jobs/'>
                            <SolidButton>Далі</SolidButton>
                        </Link>
                    </div>
                </div>
            </div>
        </>
    );
};

export default VacancyCreated;